{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v4.8.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "batch_normalization/gamma", "shape": [1], "dtype": "float32"}, {"name": "batch_normalization/beta", "shape": [1], "dtype": "float32"}, {"name": "batch_normalization/moving_mean", "shape": [1], "dtype": "float32"}, {"name": "batch_normalization/moving_variance", "shape": [1], "dtype": "float32"}, {"name": "conv2d/kernel", "shape": [3, 3, 1, 6], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [6], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [3, 3, 6, 8], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 8, 10], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [10], "dtype": "float32"}, {"name": "batch_normalization_1/gamma", "shape": [10], "dtype": "float32"}, {"name": "batch_normalization_1/beta", "shape": [10], "dtype": "float32"}, {"name": "batch_normalization_1/moving_mean", "shape": [10], "dtype": "float32"}, {"name": "batch_normalization_1/moving_variance", "shape": [10], "dtype": "float32"}, {"name": "dense/kernel", "shape": [1960, 700], "dtype": "float32"}, {"name": "dense/bias", "shape": [700], "dtype": "float32"}, {"name": "batch_normalization_2/gamma", "shape": [700], "dtype": "float32"}, {"name": "batch_normalization_2/beta", "shape": [700], "dtype": "float32"}, {"name": "batch_normalization_2/moving_mean", "shape": [700], "dtype": "float32"}, {"name": "batch_normalization_2/moving_variance", "shape": [700], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [700, 500], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [500], "dtype": "float32"}, {"name": "batch_normalization_3/gamma", "shape": [500], "dtype": "float32"}, {"name": "batch_normalization_3/beta", "shape": [500], "dtype": "float32"}, {"name": "batch_normalization_3/moving_mean", "shape": [500], "dtype": "float32"}, {"name": "batch_normalization_3/moving_variance", "shape": [500], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [500, 400], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [400], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [400, 48], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [48], "dtype": "float32"}]}]}