{"format": "graph-model", "generatedBy": "2.12.0", "convertedBy": "TensorFlow.js Converter v4.8.0", "signature": {"inputs": {"batch_normalization_16_input": {"name": "batch_normalization_16_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}}, "outputs": {"dense_19": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "48"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_4/conv2d_12/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "6"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/conv2d_12/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/conv2d_13/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "6"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/conv2d_13/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/conv2d_14/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "8"}, {"size": "10"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/conv2d_14/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/flatten_4/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_16/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1960"}, {"size": "700"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_16/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "700"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_18/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "700"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_18/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "700"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_17/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "700"}, {"size": "500"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_17/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "500"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_19/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "500"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_19/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "500"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_18/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "500"}, {"size": "400"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_18/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_19/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_19/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "batch_normalization_16_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_17/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_17/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_16/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_16/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_16/FusedBatchNormV3/Mul", "op": "Mul", "input": ["batch_normalization_16_input", "StatefulPartitionedCall/sequential_4/batch_normalization_16/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_16/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential_4/batch_normalization_16/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential_4/batch_normalization_16/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/conv2d_12/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_4/batch_normalization_16/FusedBatchNormV3", "StatefulPartitionedCall/sequential_4/conv2d_12/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_4/conv2d_12/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "filter_format": {"s": "SFdJTw=="}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "num_host_args": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_4/conv2d_13/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_4/conv2d_12/Relu", "StatefulPartitionedCall/sequential_4/conv2d_13/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_4/conv2d_13/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "num_host_args": {"i": "0"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_4/conv2d_14/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_4/conv2d_13/Relu", "StatefulPartitionedCall/sequential_4/conv2d_14/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_4/conv2d_14/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}, "leakyrelu_alpha": {"f": 0.2}, "data_format": {"s": "TkhXQw=="}, "num_host_args": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "filter_format": {"s": "SFdJTw=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_17/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_4/conv2d_14/Relu", "StatefulPartitionedCall/sequential_4/batch_normalization_17/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_17/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential_4/batch_normalization_17/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential_4/batch_normalization_17/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/max_pooling2d_4/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_4/batch_normalization_17/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_4/flatten_4/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_4/max_pooling2d_4/MaxPool", "StatefulPartitionedCall/sequential_4/flatten_4/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_16/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_4/flatten_4/Reshape", "StatefulPartitionedCall/sequential_4/dense_16/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_4/dense_16/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_18/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_4/dense_16/Relu", "StatefulPartitionedCall/sequential_4/batch_normalization_18/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_18/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_4/batch_normalization_18/batchnorm/mul_1", "StatefulPartitionedCall/sequential_4/batch_normalization_18/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_17/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_4/batch_normalization_18/batchnorm/add_1", "StatefulPartitionedCall/sequential_4/dense_17/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_4/dense_17/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_19/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_4/dense_17/Relu", "StatefulPartitionedCall/sequential_4/batch_normalization_19/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_19/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_4/batch_normalization_19/batchnorm/mul_1", "StatefulPartitionedCall/sequential_4/batch_normalization_19/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_18/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_4/batch_normalization_19/batchnorm/add_1", "StatefulPartitionedCall/sequential_4/dense_18/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_4/dense_18/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_19/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_4/dense_18/Relu", "StatefulPartitionedCall/sequential_4/dense_19/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_4/dense_19/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_19/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_4/dense_19/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_4/dense_19/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1395}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_4/conv2d_12/Conv2D/ReadVariableOp", "shape": [3, 3, 1, 6], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/conv2d_12/BiasAdd/ReadVariableOp", "shape": [6], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/conv2d_13/Conv2D/ReadVariableOp", "shape": [3, 3, 6, 8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/conv2d_13/BiasAdd/ReadVariableOp", "shape": [8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/conv2d_14/Conv2D/ReadVariableOp", "shape": [3, 3, 8, 10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/conv2d_14/BiasAdd/ReadVariableOp", "shape": [10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/flatten_4/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_16/MatMul/ReadVariableOp", "shape": [1960, 700], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_16/BiasAdd/ReadVariableOp", "shape": [700], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_18/batchnorm/mul", "shape": [700], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_18/batchnorm/sub", "shape": [700], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_17/MatMul/ReadVariableOp", "shape": [700, 500], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_17/BiasAdd/ReadVariableOp", "shape": [500], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_19/batchnorm/mul", "shape": [500], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_19/batchnorm/sub", "shape": [500], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_18/MatMul/ReadVariableOp", "shape": [500, 400], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_18/BiasAdd/ReadVariableOp", "shape": [400], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_19/MatMul/ReadVariableOp", "shape": [400, 48], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_19/BiasAdd/ReadVariableOp", "shape": [48], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_17/FusedBatchNormV3/Scaled", "shape": [10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_17/FusedBatchNormV3/Offset", "shape": [10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_16/FusedBatchNormV3/Scaled", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_16/FusedBatchNormV3/Offset", "shape": [1], "dtype": "float32"}]}]}